PayPalAPISoapBinding.SetCustomerBillingAgreement.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:SetCustomerBillingAgreementReq>
    <ns1:SetCustomerBillingAgreementRequest>
     <ns3:SetCustomerBillingAgreementRequestDetails>
      <ns3:BillingAgreementDetails>
       <ns3:BillingType>None</ns3:BillingType>
       <ns3:BillingAgreementDescription></ns3:BillingAgreementDescription>
       <ns3:PaymentType>Any</ns3:PaymentType>
       <ns3:BillingAgreementCustom></ns3:BillingAgreementCustom>
      </ns3:BillingAgreementDetails>
      <ns3:ReturnURL></ns3:ReturnURL>
      <ns3:CancelURL></ns3:CancelURL>
      <ns3:LocaleCode></ns3:LocaleCode>
      <ns3:PageStyle></ns3:PageStyle>
      <ns3:cpp-header-image></ns3:cpp-header-image>
      <ns3:cpp-header-border-color></ns3:cpp-header-border-color>
      <ns3:cpp-header-back-color></ns3:cpp-header-back-color>
      <ns3:cpp-payflow-color></ns3:cpp-payflow-color>
      <ns3:BuyerEmail></ns3:BuyerEmail>
      <ns3:ReqBillingAddress></ns3:ReqBillingAddress>
     </ns3:SetCustomerBillingAgreementRequestDetails>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:SetCustomerBillingAgreementRequest>
   </ns1:SetCustomerBillingAgreementReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
